Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA80_DFP/1.2.150/CA80/svd/PIC32CZ2051CA80176.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>ETM</name>
         <version>SYSTEM_IP1.0.0</version>
         <description>Embedded Trace Macrocell</description>
         <baseAddress>0xE0041000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x1000</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>CR</name>
               <description>ETM Main Control Register</description>
               <addressOffset>0x0</addressOffset>
               <size>32</size>
               <resetValue>0x00000411</resetValue>
               <fields>
                  <field>
                     <name>ETMPD</name>
                     <description>ETM Power Down</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PORTSIZE</name>
                     <description>Port Size bits 2:0</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>STALL</name>
                     <description>Stall Processor</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BROUT</name>
                     <description>Branch Output</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DBGRQ</name>
                     <description>Debug Request Control</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PROG</name>
                     <description>ETM Programming</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PORTSEL</name>
                     <description>ETM Port Select</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PORTMODE2</name>
                     <description>Port Mode bit 2</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PORTMODE</name>
                     <description>Port Mode bits 1:0</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>PORTSIZE3</name>
                     <description>Port Size bit 3</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TSEN</name>
                     <description>TimeStamp Enable</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CCR</name>
               <description>ETM Configuration Code Register</description>
               <addressOffset>0x4</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x8C802000</resetValue>
            </register>
            <register>
               <name>TRIGGER</name>
               <description>ETM Trigger Event Register</description>
               <addressOffset>0x8</addressOffset>
               <size>32</size>
            </register>
            <register>
               <name>SR</name>
               <description>ETM Status Register</description>
               <addressOffset>0x10</addressOffset>
               <size>32</size>
            </register>
            <register>
               <name>SCR</name>
               <description>ETM System Configuration Register</description>
               <addressOffset>0x14</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00020D09</resetValue>
            </register>
            <register>
               <name>TEEVR</name>
               <description>ETM TraceEnable Event Register</description>
               <addressOffset>0x20</addressOffset>
               <size>32</size>
            </register>
            <register>
               <name>TECR1</name>
               <description>ETM TraceEnable Control 1 Register</description>
               <addressOffset>0x24</addressOffset>
               <size>32</size>
            </register>
            <register>
               <name>FFLR</name>
               <description>ETM FIFO Full Level Register</description>
               <addressOffset>0x28</addressOffset>
               <size>32</size>
            </register>
            <register>
               <name>CNTRLDVR1</name>
               <description>ETM Free-running Counter Reload Value</description>
               <addressOffset>0x140</addressOffset>
               <size>32</size>
            </register>
            <register>
               <name>SYNCFR</name>
               <description>ETM Synchronization Frequency Register</description>
               <addressOffset>0x1E0</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000400</resetValue>
            </register>
            <register>
               <name>IDR</name>
               <description>ETM ID Register</description>
               <addressOffset>0x1E4</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x4114F250</resetValue>
            </register>
            <register>
               <name>CCER</name>
               <description>ETM Configuration Code Extension Register</description>
               <addressOffset>0x1E8</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x18541800</resetValue>
            </register>
            <register>
               <name>TESSEICR</name>
               <description>ETM TraceEnable Start/Stop EmbeddedICE Control Register</description>
               <addressOffset>0x1F0</addressOffset>
               <size>32</size>
            </register>
            <register>
               <name>TSEVT</name>
               <description>ETM TimeStamp Event Register</description>
               <addressOffset>0x1F8</addressOffset>
               <size>32</size>
            </register>
            <register>
               <name>TRACEIDR</name>
               <description>ETM CoreSight Trace ID Register</description>
               <addressOffset>0x200</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>IDR2</name>
               <description>ETM ID Register 2</description>
               <addressOffset>0x208</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>PDSR</name>
               <description>ETM Device Power-Down Status Register</description>
               <addressOffset>0x314</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000001</resetValue>
            </register>
            <register>
               <name>ITMISCIN</name>
               <description>ETM Integration Test Miscellaneous Inputs</description>
               <addressOffset>0xEE0</addressOffset>
               <size>32</size>
               <access>read-only</access>
            </register>
            <register>
               <name>ITTRIGOUT</name>
               <description>ETM Integration Test Trigger Out</description>
               <addressOffset>0xEE8</addressOffset>
               <size>32</size>
               <access>write-only</access>
            </register>
            <register>
               <name>ITATBCTR2</name>
               <description>ETM Integration Test ATB Control 2</description>
               <addressOffset>0xEF0</addressOffset>
               <size>32</size>
               <access>read-only</access>
            </register>
            <register>
               <name>ITATBCTR0</name>
               <description>ETM Integration Test ATB Control 0</description>
               <addressOffset>0xEF8</addressOffset>
               <size>32</size>
               <access>write-only</access>
            </register>
            <register>
               <name>ITCTRL</name>
               <description>ETM Integration Mode Control Register</description>
               <addressOffset>0xF00</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>INTEGRATION</name>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CLAIMSET</name>
               <description>ETM Claim Tag Set Register</description>
               <addressOffset>0xFA0</addressOffset>
               <size>32</size>
            </register>
            <register>
               <name>CLAIMCLR</name>
               <description>ETM Claim Tag Clear Register</description>
               <addressOffset>0xFA4</addressOffset>
               <size>32</size>
            </register>
            <register>
               <name>LAR</name>
               <description>ETM Lock Access Register</description>
               <addressOffset>0xFB0</addressOffset>
               <size>32</size>
               <access>write-only</access>
            </register>
            <register>
               <name>LSR</name>
               <description>ETM Lock Status Register</description>
               <addressOffset>0xFB4</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>Present</name>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>Access</name>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ByteAcc</name>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>AUTHSTATUS</name>
               <description>ETM Authentication Status Register</description>
               <addressOffset>0xFB8</addressOffset>
               <size>32</size>
               <access>read-only</access>
            </register>
            <register>
               <name>DEVTYPE</name>
               <description>ETM CoreSight Device Type Register</description>
               <addressOffset>0xFCC</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000013</resetValue>
            </register>
            <register>
               <name>PIDR4</name>
               <description>ETM Peripheral Identification Register #4</description>
               <addressOffset>0xFD0</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000004</resetValue>
            </register>
            <register>
               <name>PIDR5</name>
               <description>ETM Peripheral Identification Register #5</description>
               <addressOffset>0xFD4</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>PIDR6</name>
               <description>ETM Peripheral Identification Register #6</description>
               <addressOffset>0xFD8</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>PIDR7</name>
               <description>ETM Peripheral Identification Register #7</description>
               <addressOffset>0xFDC</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>PIDR0</name>
               <description>ETM Peripheral Identification Register #0</description>
               <addressOffset>0xFE0</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000025</resetValue>
            </register>
            <register>
               <name>PIDR1</name>
               <description>ETM Peripheral Identification Register #1</description>
               <addressOffset>0xFE4</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x000000B9</resetValue>
            </register>
            <register>
               <name>PIDR2</name>
               <description>ETM Peripheral Identification Register #2</description>
               <addressOffset>0xFE8</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x0000000B</resetValue>
            </register>
            <register>
               <name>PIDR3</name>
               <description>ETM Peripheral Identification Register #3</description>
               <addressOffset>0xFEC</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>CIDR0</name>
               <description>ETM Component  Identification Register #0</description>
               <addressOffset>0xFF0</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x0000000D</resetValue>
            </register>
            <register>
               <name>CIDR1</name>
               <description>ETM Component  Identification Register #1</description>
               <addressOffset>0xFF4</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000090</resetValue>
            </register>
            <register>
               <name>CIDR2</name>
               <description>ETM Component  Identification Register #2</description>
               <addressOffset>0xFF8</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000005</resetValue>
            </register>
            <register>
               <name>CIDR3</name>
               <description>ETM Component  Identification Register #3</description>
               <addressOffset>0xFFC</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x000000B1</resetValue>
            </register>
