Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA80_DFP/1.2.150/CA80/svd/PIC32CZ2051CA80176.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>NVIC</name>
         <version>SYSTEM_IP1.0.0</version>
         <description>Nested Vectored Interrupt Controller</description>
         <baseAddress>0xE000E000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x456</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>ICTR</name>
               <description>Interrupt Controller Type Register</description>
               <addressOffset>0x4</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>INTLINESNUM</name>
                     <description>Number of 32-interrupt groups - 1</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>7</dim>
               <dimIncrement>4</dimIncrement>
               <name>ISER[%s]</name>
               <description>Interrupt Set Enable Register</description>
               <addressOffset>0x100</addressOffset>
               <size>32</size>
               <resetValue>0</resetValue>
               <fields>
                  <field>
                     <name>SETENA</name>
                     <description>Interrupt set enable bits</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>7</dim>
               <dimIncrement>4</dimIncrement>
               <name>ICER[%s]</name>
               <description>Interrupt Clear Enable Register</description>
               <addressOffset>0x180</addressOffset>
               <size>32</size>
               <resetValue>0</resetValue>
               <fields>
                  <field>
                     <name>CLRENA</name>
                     <description>Interrupt clear-enable bits</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>7</dim>
               <dimIncrement>4</dimIncrement>
               <name>ISPR[%s]</name>
               <description>Interrupt Set Pending Register</description>
               <addressOffset>0x200</addressOffset>
               <size>32</size>
               <resetValue>0</resetValue>
               <fields>
                  <field>
                     <name>SETPEND</name>
                     <description>Interrupt set-pending bits</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>7</dim>
               <dimIncrement>4</dimIncrement>
               <name>ICPR[%s]</name>
               <description>Interrupt Clear Pending Register</description>
               <addressOffset>0x280</addressOffset>
               <size>32</size>
               <resetValue>0</resetValue>
               <fields>
                  <field>
                     <name>CLRPEND</name>
                     <description>Interrupt clear-pending bits</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>7</dim>
               <dimIncrement>4</dimIncrement>
               <name>IABR[%s]</name>
               <description>Interrupt Active Bit Register</description>
               <addressOffset>0x300</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0</resetValue>
               <fields>
                  <field>
                     <name>ACTIVE</name>
                     <description>Interrupt active bits</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>56</dim>
               <dimIncrement>1</dimIncrement>
               <name>IPR[%s]</name>
               <description>Interrupt Priority Register n</description>
               <addressOffset>0x400</addressOffset>
               <size>8</size>
               <resetValue>0</resetValue>
               <fields>
                  <field>
                     <name>PRI0</name>
                     <description>Priority of interrupt n</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
      <peripheral>
         <name>OSC32KCTRL</name>
         <version>037172a0</version>
         <description>32kHz Oscillators Control</description>
         <baseAddress>0x44042000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x20</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>OSC32KCTRL_FAIL</name>
            <description>32K Oscillator Fail</description>
            <value>10</value>
         </interrupt>
         <interrupt>
            <name>OSC32KCTRL_RDY</name>
            <description>32K Oscillator Ready</description>
            <value>11</value>
         </interrupt>
         <registers>
            <register>
               <name>INTENCLR</name>
               <description>Interrupt Enable Clear</description>
               <addressOffset>0x0</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>XOSC32KRDY</name>
                     <description>XOSC32K Ready Interrupt Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>XOSC32KFAIL</name>
                     <description>XOSC32K Clock Failure Detector Interrupt Enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>INTENSET</name>
               <description>Interrupt Enable Set</description>
               <addressOffset>0x4</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>XOSC32KRDY</name>
                     <description>XOSC32K Ready Interrupt Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>XOSC32KFAIL</name>
                     <description>XOSC32K Clock Failure Detector Interrupt Enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>INTFLAG</name>
               <description>Interrupt Flag Status and Clear</description>
               <addressOffset>0x8</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>XOSC32KRDY</name>
                     <description>XOSC32K Ready</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>XOSC32KFAIL</name>
                     <description>XOSC32K Clock Failure Detector</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>STATUS</name>
               <description>Power and Clocks Status</description>
               <addressOffset>0xC</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>XOSC32KRDY</name>
                     <description>XOSC32K Ready</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>XOSC32KFAIL</name>
                     <description>XOSC32K Clock Failure Detector</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>XOSC32KSW</name>
                     <description>XOSC32K Clock switch</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CLKSELCTRL</name>
               <description>Clock Selection Control</description>
               <addressOffset>0x10</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>RTCSEL</name>
                     <description>RTC Clock Selection</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>RTCSELSelect</name>
                        <enumeratedValue>
                           <name>ULP32K</name>
                           <description>32.768kHz from 32kHz internal ULP oscillator</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ULP1K</name>
                           <description>1.024kHz from 32kHz internal ULP oscillator</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>XOSC32K</name>
                           <description>32.768kHz from 32.768kHz external crystal oscillator</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>XOSC1K</name>
                           <description>1.024kHz from 32.768kHz internal oscillator</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>HSMSEL</name>
                     <description>HSM Clock Selection</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>HSMSELSelect</name>
                        <enumeratedValue>
                           <name>ULP32K</name>
                           <description>32.768kHz from 32kHz internal ULP oscillator</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>XOSC32K</name>
                           <description>32.768kHz from 32.768kHz external crystal oscillator</description>
                           <value>0x2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>CFDCTRL</name>
               <description>Clock Failure Detector Control</description>
               <addressOffset>0x14</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CFDEN</name>
                     <description>Clock Failure Detector Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWBACK</name>
                     <description>Clock Switch Back</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CFDPRESC</name>
                     <description>Clock Failure Detector Prescaler</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>EVCTRL</name>
               <description>Event Control</description>
               <addressOffset>0x18</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CFDEO</name>
                     <description>Clock Failure Detector Event Output Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>XOSC32K</name>
               <description>32kHz External Crystal Oscillator (XOSC32K) Control</description>
               <addressOffset>0x1C</addressOffset>
               <size>32</size>
               <resetValue>0x00200080</resetValue>
               <fields>
                  <field>
                     <name>ENABLE</name>
                     <description>Oscillator Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>XTALEN</name>
                     <description>Crystal Oscillator Enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ONDEMAND</name>
                     <description>On Demand Mode</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>STARTUP</name>
                     <description>Startup Mode</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <name>STARTUPSelect</name>
                        <enumeratedValue>
                           <name>1CYCLE</name>
                           <description>1 ULP clock cycle</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>16CYCLES</name>
                           <description>16 ULP clock cycles</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>32CYCLES</name>
                           <description>32 ULP clock cycles</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>2048CYCLES</name>
                           <description>2048 ULP clock cycles</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>4096CYCLES</name>
                           <description>4096 ULP clock cycles</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>8192CYCLES</name>
                           <description>8192 ULP clock cycles</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>16384CYCLES</name>
                           <description>16384 ULP clock cycles</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>32768CYCLES</name>
                           <description>32768 ULP clock cycles</description>
                           <value>0x7</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>65536CYCLES</name>
                           <description>65536 ULP clock cycles</description>
                           <value>0x8</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>131072CYCLES</name>
                           <description>131072 ULP clock cycles</description>
                           <value>0x9</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>262144CYCLES</name>
                           <description>262144 ULP clock cycles</description>
                           <value>0xA</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ENSL</name>
                     <description>Enable Servo Loop</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BOOST</name>
                     <description>Gain Boost</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CGM</name>
                     <description>Control Gain Mode</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <name>CGMSelect</name>
                        <enumeratedValue>
                           <name>CGM0</name>
                           <description>The lower Control Gain Mode value</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CGM1</name>
                           <description>A higher Control Gain Mode value than CGM0</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CGM2</name>
                           <description>A higher Control Gain Mode value than CGM1</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CGM3</name>
                           <description>A higher Control Gain Mode value than CGM2</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CGM4</name>
                           <description>A higher Control Gain Mode value than CGM3</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CGM5</name>
                           <description>A higher Control Gain Mode value than CGM4</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CGM6</name>
                           <description>A higher Control Gain Mode value than CGM5</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CGM7</name>
                           <description>A higher Control Gain Mode value than CGM6</description>
                           <value>0x7</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CGM8</name>
                           <description>A higher Control Gain Mode value than CGM7</description>
                           <value>0x8</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CGM9</name>
                           <description>A higher Control Gain Mode value than CGM8</description>
                           <value>0x9</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CGM10</name>
                           <description>A higher Control Gain Mode value than CGM9</description>
                           <value>0xA</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CGM11</name>
                           <description>A higher Control Gain Mode value than CGM10</description>
                           <value>0xB</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CGM12</name>
                           <description>A higher Control Gain Mode value than CGM11</description>
                           <value>0xC</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CGM13</name>
                           <description>A higher Control Gain Mode value than CGM12</description>
                           <value>0xD</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CGM14</name>
                           <description>A higher Control Gain Mode value than CGM13</description>
                           <value>0xE</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CGM15</name>
                           <description>The highest Control Gain Mode value</description>
                           <value>0xF</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CTRLX</name>
                     <description>Extended Control</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
