Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA80_DFP/1.2.150/CA80/svd/PIC32CZ2051CA80176.svd
            <register>
               <name>EVCTRL</name>
               <description>Event Control</description>
               <addressOffset>0x20</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>EVACT0</name>
                     <description>Timer/counter Input Event0 Action</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>EVACT0Select</name>
                        <enumeratedValue>
                           <name>OFF</name>
                           <description>Event action disabled</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RETRIGGER</name>
                           <description>Start, restart or re-trigger counter on event</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>COUNTEV</name>
                           <description>Count on event</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>START</name>
                           <description>Start counter on event</description>
                           <value>3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INC</name>
                           <description>Increment counter on event</description>
                           <value>4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>COUNT</name>
                           <description>Count on active state of asynchronous event</description>
                           <value>5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>STAMP</name>
                           <description>Stamp capture</description>
                           <value>6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FAULT</name>
                           <description>Non-recoverable fault</description>
                           <value>7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>EVACT1</name>
                     <description>Timer/counter Input Event1 Action</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>EVACT1Select</name>
                        <enumeratedValue>
                           <name>OFF</name>
                           <description>Event action disabled</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RETRIGGER</name>
                           <description>Re-trigger counter on event</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIR</name>
                           <description>Direction control</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>STOP</name>
                           <description>Stop counter on event</description>
                           <value>3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DEC</name>
                           <description>Decrement counter on event</description>
                           <value>4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PWP</name>
                           <description>Period capture value in CC1 register, pulse width capture value in CC0 register</description>
                           <value>6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FAULT</name>
                           <description>Non-recoverable fault</description>
                           <value>7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CNTSEL</name>
                     <description>Timer/counter Output Event Mode</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>CNTSELSelect</name>
                        <enumeratedValue>
                           <name>START</name>
                           <description>An interrupt/event is generated when a new counter cycle starts</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>END</name>
                           <description>An interrupt/event is generated when a counter cycle ends</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BOUNDARY</name>
                           <description>An interrupt/event is generated when a new counter cycle starts or a counter cycle ends</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>OVFEO</name>
                     <description>Overflow/Underflow Output Event Enable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TRGEO</name>
                     <description>Retrigger Output Event Enable</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CNTEO</name>
                     <description>Timer/counter Output Event Enable</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TCINV0</name>
                     <description>Inverted Event 0 Input Enable</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TCINV1</name>
                     <description>Inverted Event 1 Input Enable</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TCEI0</name>
                     <description>Timer/counter Event 0 Input Enable</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TCEI1</name>
                     <description>Timer/counter Event 1 Input Enable</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MCEI0</name>
                     <description>Match or Capture Channel 0 Event Input Enable</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MCEI1</name>
                     <description>Match or Capture Channel 1 Event Input Enable</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MCEI2</name>
                     <description>Match or Capture Channel 2 Event Input Enable</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MCEI3</name>
                     <description>Match or Capture Channel 3 Event Input Enable</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MCEI4</name>
                     <description>Match or Capture Channel 4 Event Input Enable</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MCEI5</name>
                     <description>Match or Capture Channel 5 Event Input Enable</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MCEI6</name>
                     <description>Match or Capture Channel 6 Event Input Enable</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MCEI7</name>
                     <description>Match or Capture Channel 7 Event Input Enable</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MCEO0</name>
                     <description>Match or Capture Channel 0 Event Output Enable</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MCEO1</name>
                     <description>Match or Capture Channel 1 Event Output Enable</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MCEO2</name>
                     <description>Match or Capture Channel 2 Event Output Enable</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MCEO3</name>
                     <description>Match or Capture Channel 3 Event Output Enable</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MCEO4</name>
                     <description>Match or Capture Channel 4 Event Output Enable</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MCEO5</name>
                     <description>Match or Capture Channel 5 Event Output Enable</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MCEO6</name>
                     <description>Match or Capture Channel 6 Event Output Enable</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MCEO7</name>
                     <description>Match or Capture Channel 7 Event Output Enable</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>INTENCLR</name>
               <description>Interrupt Enable Clear</description>
               <addressOffset>0x24</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>OVF</name>
                     <description>Overflow Interrupt Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TRG</name>
                     <description>Retrigger Interrupt Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CNT</name>
                     <description>Counter Interrupt Enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ERR</name>
                     <description>Error Interrupt Enable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>UFS</name>
                     <description>Non-Recoverable Update Fault Interrupt Enable</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DFS</name>
                     <description>Non-Recoverable Debug Fault Interrupt Enable</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FAULTA</name>
                     <description>Recoverable Fault A Interrupt Enable</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FAULTB</name>
                     <description>Recoverable Fault B Interrupt Enable</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FAULT0</name>
                     <description>Non-Recoverable Fault 0 Interrupt Enable</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FAULT1</name>
                     <description>Non-Recoverable Fault 1 Interrupt Enable</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MC0</name>
                     <description>Match or Capture Channel 0 Interrupt Enable</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MC1</name>
                     <description>Match or Capture Channel 1 Interrupt Enable</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MC2</name>
                     <description>Match or Capture Channel 2 Interrupt Enable</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MC3</name>
                     <description>Match or Capture Channel 3 Interrupt Enable</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MC4</name>
                     <description>Match or Capture Channel 4 Interrupt Enable</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MC5</name>
                     <description>Match or Capture Channel 5 Interrupt Enable</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MC6</name>
                     <description>Match or Capture Channel 6 Interrupt Enable</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MC7</name>
                     <description>Match or Capture Channel 7 Interrupt Enable</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>INTENSET</name>
               <description>Interrupt Enable Set</description>
               <addressOffset>0x28</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>OVF</name>
                     <description>Overflow Interrupt Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TRG</name>
                     <description>Retrigger Interrupt Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CNT</name>
                     <description>Counter Interrupt Enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ERR</name>
                     <description>Error Interrupt Enable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>UFS</name>
                     <description>Non-Recoverable Update Fault Interrupt Enable</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DFS</name>
                     <description>Non-Recoverable Debug Fault Interrupt Enable</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FAULTA</name>
                     <description>Recoverable Fault A Interrupt Enable</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FAULTB</name>
                     <description>Recoverable Fault B Interrupt Enable</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FAULT0</name>
                     <description>Non-Recoverable Fault 0 Interrupt Enable</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FAULT1</name>
                     <description>Non-Recoverable Fault 1 Interrupt Enable</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MC0</name>
                     <description>Match or Capture Channel 0 Interrupt Enable</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MC1</name>
                     <description>Match or Capture Channel 1 Interrupt Enable</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MC2</name>
                     <description>Match or Capture Channel 2 Interrupt Enable</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MC3</name>
                     <description>Match or Capture Channel 3 Interrupt Enable</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MC4</name>
                     <description>Match or Capture Channel 4 Interrupt Enable</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MC5</name>
                     <description>Match or Capture Channel 5 Interrupt Enable</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MC6</name>
                     <description>Match or Capture Channel 6 Interrupt Enable</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MC7</name>
                     <description>Match or Capture Channel 7 Interrupt Enable</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
